app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
  <div id="comments">
  	<h2><%= @post.comments.count %> Comments</h2>